IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MCSPI1_MCSPI1.xml
	<register id="MCSPI1_SYSSTATUS" acronym="MCSPI1_SYSSTATUS" offset="0x114" width="32" description="">
		<bitfield id="RESERVED" width="31" begin="31" end="1" resetval="0x0" description="Reserved for module specific status information Read returns 0" range="31 - 1" rwaccess="RO"/> 
		<bitfield id="RESETDONE" width="1" begin="0" end="0" resetval="0x1" description="Internal Reset Monitoring" range="0" rwaccess="RO"/>
	</register>
	<register id="MCSPI1_IRQSTATUS" acronym="MCSPI1_IRQSTATUS" offset="0x118" width="32" description="">
		<bitfield id="RESERVED" width="14" begin="31" end="18" resetval="0x0" description="Reads returns 0" range="31 - 18" rwaccess="RO"/> 
		<bitfield id="EOW" width="1" begin="17" end="17" resetval="0x0" description="End of word count event when a channel is enabled using the FIFO buffer and the channel had sent the number of SPI word defined by MCSPI_XFERLEVEL[WCNT]" range="17" rwaccess="RW"/> 
		<bitfield id="WKS" width="1" begin="16" end="16" resetval="0x0" description="Wake Up event in slave mode when an active control signal is detected on the SPIEN line programmed in the field MCSPI_CH0CONF[SPIENSLV]" range="16" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="1" begin="15" end="15" resetval="0x0" description="Reads returns 0" range="15" rwaccess="RO"/> 
		<bitfield id="RX3_FULL" width="1" begin="14" end="14" resetval="0x0" description="Receiver register is full or almost full Only when Channel 3 is enabled" range="14" rwaccess="RW"/> 
		<bitfield id="TX3_UNDERFLOW" width="1" begin="13" end="13" resetval="0x0" description="Transmitter register underflow Only when Channel 3 is enabled The transmitter register is empty [not updated by Host or DMA with new data] before its time slot assignment Exception: No TX_underflow event when no data has been loaded into the transmitter register since channel has been enabled" range="13" rwaccess="RW"/> 
		<bitfield id="TX3_EMPTY" width="1" begin="12" end="12" resetval="0x0" description="Transmitter register is empty or almost empty Note: Enabling the channel automatically rises this event" range="12" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="1" begin="11" end="11" resetval="0x0" description="Reads returns 0" range="11" rwaccess="RO"/> 
		<bitfield id="RX2_FULL" width="1" begin="10" end="10" resetval="0x0" description="Receiver register full or almost full Channel 2" range="10" rwaccess="RW"/> 
		<bitfield id="TX2_UNDERFLOW" width="1" begin="9" end="9" resetval="0x0" description="Transmitter register underflow Channel 2" range="9" rwaccess="RW"/> 
		<bitfield id="TX2_EMPTY" width="1" begin="8" end="8" resetval="0x0" description="Transmitter register empty or almost empty Channel 2" range="8" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="1" begin="7" end="7" resetval="0x0" description="Reads returns 0" range="7" rwaccess="RO"/> 
		<bitfield id="RX1_FULL" width="1" begin="6" end="6" resetval="0x0" description="Receiver register full or almost full Channel 1" range="6" rwaccess="RW"/> 
		<bitfield id="TX1_UNDERFLOW" width="1" begin="5" end="5" resetval="0x0" description="Transmitter register underflow Channel 1" range="5" rwaccess="RW"/> 
		<bitfield id="TX1_EMPTY" width="1" begin="4" end="4" resetval="0x0" description="Transmitter register empty or almost empty Channel 1" range="4" rwaccess="RW"/> 
		<bitfield id="RX0_OVERFLOW" width="1" begin="3" end="3" resetval="0x0" description="Receiver register overflow [slave mode only] Channel 0" range="3" rwaccess="RW"/> 
		<bitfield id="RX0_FULL" width="1" begin="2" end="2" resetval="0x0" description="Receiver register full or almost full Channel 0" range="2" rwaccess="RW"/> 
		<bitfield id="TX0_UNDERFLOW" width="1" begin="1" end="1" resetval="0x0" description="Transmitter register underflow Channel 0" range="1" rwaccess="RW"/> 
		<bitfield id="TX0_EMPTY" width="1" begin="0" end="0" resetval="0x0" description="Transmitter register empty or almost empty Channel 0" range="0" rwaccess="RW"/>
	</register>
	<register id="MCSPI1_IRQENABLE" acronym="MCSPI1_IRQENABLE" offset="0x11C" width="32" description="">
		<bitfield id="RESERVED" width="14" begin="31" end="18" resetval="0x0" description="Reads return 0" range="31 - 18" rwaccess="RO"/> 
		<bitfield id="EOW_ENABLE" width="1" begin="17" end="17" resetval="0x0" description="End of Word count Interrupt Enable" range="17" rwaccess="RW"/> 
		<bitfield id="WKE" width="1" begin="16" end="16" resetval="0x0" description="Wake Up event interrupt Enable in slave mode when an active control signal is detected on the SPIEN line programmed in the field MCSPI_CH0CONF[SPIENSLV]" range="16" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="1" begin="15" end="15" resetval="0x0" description="Reads returns 0" range="15" rwaccess="RO"/> 
		<bitfield id="RX3_FULL_ENABLE" width="1" begin="14" end="14" resetval="0x0" description="Receiver register Full Interrupt Enable Ch 3" range="14" rwaccess="RW"/> 
		<bitfield id="TX3_UNDERFLOW_ENABLE" width="1" begin="13" end="13" resetval="0x0" description="Transmitter register Underflow Interrupt Enable Ch 3" range="13" rwaccess="RW"/> 
		<bitfield id="TX3_EMPTY_ENABLE" width="1" begin="12" end="12" resetval="0x0" description="Transmitter register Empty Interrupt Enable Ch3" range="12" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="1" begin="11" end="11" resetval="0x0" description="Reads return 0" range="11" rwaccess="RO"/> 
		<bitfield id="RX2_FULL_ENABLE" width="1" begin="10" end="10" resetval="0x0" description="Receiver register Full Interrupt Enable Ch 2" range="10" rwaccess="RW"/> 
		<bitfield id="TX2_UNDERFLOW_ENABLE" width="1" begin="9" end="9" resetval="0x0" description="Transmitter register Underflow Interrupt Enable Ch 2" range="9" rwaccess="RW"/> 
		<bitfield id="TX2_EMPTY_ENABLE" width="1" begin="8" end="8" resetval="0x0" description="Transmitter register Empty Interrupt Enable Ch 2" range="8" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="1" begin="7" end="7" resetval="0x0" description="Reads return 0" range="7" rwaccess="RO"/> 
		<bitfield id="RX1_FULL_ENABLE" width="1" begin="6" end="6" resetval="0x0" description="Receiver register Full Interrupt Enable Ch 1" range="6" rwaccess="RW"/> 
		<bitfield id="TX1_UNDERFLOW_ENABLE" width="1" begin="5" end="5" resetval="0x0" description="Transmitter register Underflow Interrupt Enable Ch 1" range="5" rwaccess="RW"/> 
		<bitfield id="TX1_EMPTY_ENABLE" width="1" begin="4" end="4" resetval="0x0" description="Transmitter register Empty Interrupt Enable Ch 1" range="4" rwaccess="RW"/> 
		<bitfield id="RX0_OVERFLOW_ENABLE" width="1" begin="3" end="3" resetval="0x0" description="Receiver register Overflow Interrupt Enable Ch 0" range="3" rwaccess="RW"/> 
		<bitfield id="RX0_FULL_ENABLE" width="1" begin="2" end="2" resetval="0x0" description="Receiver register Full Interrupt Enable Ch 0" range="2" rwaccess="RW"/> 
		<bitfield id="TX0_UNDERFLOW_ENABLE" width="1" begin="1" end="1" resetval="0x0" description="Transmitter register Underflow Interrupt Enable Ch 0" range="1" rwaccess="RW"/> 
		<bitfield id="TX0_EMPTY_ENABLE" width="1" begin="0" end="0" resetval="0x0" description="Transmitter register Empty Interrupt Enable Ch 0" range="0" rwaccess="RW"/>
	</register>
