IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MCSPI1_MCSPI1.xml
	<register id="MCSPI1_TX2" acronym="MCSPI1_TX2" offset="0x160" width="32" description="">
		<bitfield id="TDATA" width="32" begin="31" end="0" resetval="0x0" description="Channel 2 Data to transmit" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MCSPI1_RX2" acronym="MCSPI1_RX2" offset="0x164" width="32" description="">
		<bitfield id="RDATA" width="32" begin="31" end="0" resetval="0x0" description="Channel 2 Received Data" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MCSPI1_CH3CONF" acronym="MCSPI1_CH3CONF" offset="0x168" width="32" description="">
		<bitfield id="RESERVED" width="2" begin="31" end="30" resetval="0x0" description="read returns 0" range="31 - 30" rwaccess="RO"/> 
		<bitfield id="CLKG" width="1" begin="29" end="29" resetval="0x0" description="Clock divider granularity This register defines the granularity of channel clock divider: power of two or one clock cycle granularity When this bit is set the register MCSPI_CHCTRL[EXTCLK] must be configured to reach a maximum of 4096 clock divider ratio Then The clock divider ratio is a concatenation of MCSPI_CHCONF[CLKD] and MCSPI_CHCTRL[EXTCLK] values" range="29" rwaccess="RW"/> 
		<bitfield id="FFER" width="1" begin="28" end="28" resetval="0x0" description="FIFO enabled for receive:Only one channel can have this bit field set" range="28" rwaccess="RW"/> 
		<bitfield id="FFEW" width="1" begin="27" end="27" resetval="0x0" description="FIFO enabled for Transmit:Only one channel can have this bit field set" range="27" rwaccess="RW"/> 
		<bitfield id="TCS3" width="2" begin="26" end="25" resetval="0x0" description="Chip Select Time Control This 2-bits field defines the number of interface clock cycles between CS toggling and first or last edge of SPI clock" range="26 - 25" rwaccess="RW"/> 
		<bitfield id="SBPOL" width="1" begin="24" end="24" resetval="0x0" description="Start bit polarity" range="24" rwaccess="RW"/> 
		<bitfield id="SBE" width="1" begin="23" end="23" resetval="0x0" description="Start bit enable for SPI transfer" range="23" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="2" begin="22" end="21" resetval="0x0" description="read returns 0" range="22 - 21" rwaccess="RO"/> 
		<bitfield id="FORCE" width="1" begin="20" end="20" resetval="0x0" description="Manual SPIEN assertion to keep SPIEN active between SPI words [single channel master mode only]" range="20" rwaccess="RW"/> 
		<bitfield id="TURBO" width="1" begin="19" end="19" resetval="0x0" description="Turbo mode" range="19" rwaccess="RW"/> 
		<bitfield id="IS" width="1" begin="18" end="18" resetval="0x1" description="Input Select" range="18" rwaccess="RW"/> 
		<bitfield id="DPE1" width="1" begin="17" end="17" resetval="0x1" description="Transmission Enable for data line 1 [SPIDATAGZEN[1]]" range="17" rwaccess="RW"/> 
		<bitfield id="DPE0" width="1" begin="16" end="16" resetval="0x0" description="Transmission Enable for data line 0 [SPIDATAGZEN[0]]" range="16" rwaccess="RW"/> 
		<bitfield id="DMAR" width="1" begin="15" end="15" resetval="0x0" description="DMA Read request The DMA Read request line is asserted when the channel is enabled and a new data is available in the receive register of the channel The DMA Read request line is deasserted on read completion of the receive register of the channel" range="15" rwaccess="RW"/> 
		<bitfield id="DMAW" width="1" begin="14" end="14" resetval="0x0" description="DMA Write request The DMA Write request line is asserted when The channel is enabled and the transmitter register of the channel is empty The DMA Write request line is deasserted on load completion of the transmitter register of the channel" range="14" rwaccess="RW"/> 
		<bitfield id="TRM" width="2" begin="13" end="12" resetval="0x0" description="Transmit/Receive modes" range="13 - 12" rwaccess="RW"/> 
		<bitfield id="WL" width="5" begin="11" end="7" resetval="0x0" description="SPI word length" range="11 - 7" rwaccess="RW"/> 
		<bitfield id="EPOL" width="1" begin="6" end="6" resetval="0x0" description="SPIEN polarity" range="6" rwaccess="RW"/> 
		<bitfield id="CLKD" width="4" begin="5" end="2" resetval="0x0" description="Frequency divider for SPICLK [only when the module is a Master SPI device] A programmable clock divider divides the SPI reference clock [CLKSPIREF] with a 4-bit value, and results in a new clock SPICLK available to shift-in and shift-out data By default the clock divider ratio has a power of two granularity when MCSPI_CHCONF[CLKG] is cleared, Otherwise this register is the 4 LSB bit of a 12-bit register concatenated with clock divider extension MCSPI_CHCTRL[EXTCLK] registerThe value description below defines the clock ratio when MCSPI_CHCONF[CLKG] is set to 0" range="5 - 2" rwaccess="RW"/> 
		<bitfield id="POL" width="1" begin="1" end="1" resetval="0x0" description="SPICLK polarity" range="1" rwaccess="RW"/> 
		<bitfield id="PHA" width="1" begin="0" end="0" resetval="0x0" description="SPICLK phase" range="0" rwaccess="RW"/>
	</register>
	<register id="MCSPI1_CH3STAT" acronym="MCSPI1_CH3STAT" offset="0x16C" width="32" description="">
		<bitfield id="RESERVED" width="25" begin="31" end="7" resetval="0x0" description="Read returns 0" range="31 - 7" rwaccess="RO"/> 
		<bitfield id="RXFFF" width="1" begin="6" end="6" resetval="0x0" description="Channel 'i' FIFO Receive Buffer Full Status" range="6" rwaccess="RO"/> 
		<bitfield id="RXFFE" width="1" begin="5" end="5" resetval="0x0" description="Channel 'i' FIFO Receive Buffer Empty Status" range="5" rwaccess="RO"/> 
		<bitfield id="TXFFF" width="1" begin="4" end="4" resetval="0x0" description="Channel 'i' FIFO Transmit Buffer Full Status" range="4" rwaccess="RO"/> 
		<bitfield id="TXFFE" width="1" begin="3" end="3" resetval="0x0" description="Channel 'i' FIFO Transmit Buffer Empty Status" range="3" rwaccess="RO"/> 
		<bitfield id="EOT" width="1" begin="2" end="2" resetval="0x0" description="Channel 'i' End of transfer Status The definitions of beginning and end of transfer vary with master versus slave and the transfer format [Transmit/Receive modes, Turbo mode] See dedicated chapters for details" range="2" rwaccess="RO"/> 
		<bitfield id="TXS" width="1" begin="1" end="1" resetval="0x0" description="Channel 'i' Transmitter Register Status" range="1" rwaccess="RO"/> 
		<bitfield id="RXS" width="1" begin="0" end="0" resetval="0x0" description="Channel 'i' Receiver Register Status" range="0" rwaccess="RO"/>
	</register>
	<register id="MCSPI1_CH3CTRL" acronym="MCSPI1_CH3CTRL" offset="0x170" width="32" description="">
		<bitfield id="RESERVED" width="16" begin="31" end="16" resetval="0x0" description="Read returns 0" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="EXTCLK" width="8" begin="15" end="8" resetval="0x0" description="Clock ratio extension: This register is used to concatenate with MCSPI_CHCONF[CLKD] register for clock ratio only when granularity is one clock cycle [MCSPI_CHCONF[CLKG] set to 1] Then the max value reached is 4096 clock divider ratio" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="7" begin="7" end="1" resetval="0x0" description="Read returns 0" range="7 - 1" rwaccess="RO"/> 
		<bitfield id="EN" width="1" begin="0" end="0" resetval="0x0" description="Channel Enable" range="0" rwaccess="RW"/>
	</register>
	<register id="MCSPI1_TX3" acronym="MCSPI1_TX3" offset="0x174" width="32" description="">
		<bitfield id="TDATA" width="32" begin="31" end="0" resetval="0x0" description="Channel 3 Data to transmit" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MCSPI1_RX3" acronym="MCSPI1_RX3" offset="0x178" width="32" description="">
		<bitfield id="RDATA" width="32" begin="31" end="0" resetval="0x0" description="Channel 3 Received Data" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MCSPI1_XFERLEVEL" acronym="MCSPI1_XFERLEVEL" offset="0x17C" width="32" description="">
		<bitfield id="WCNT" width="16" begin="31" end="16" resetval="0x0" description="Spi word counterThis register holds the programmable value of number of SPI word to be transferred on channel which is using the FIFO bufferWhen transfer had started, a read back in this register returns the current SPI word transfer index" range="31 - 16" rwaccess="RW"/> 
		<bitfield id="AFL" width="8" begin="15" end="8" resetval="0x0" description="Buffer Almost Full This register holds the programmable almost full level value used to determine almost full buffer condition If the user wants an interrupt or a DMA read request to be issued during a receive operation when the data buffer holds at least n bytes, then the buffer MCSPI_MODULCTRL[AFL] must be set with n-1The size of this register is defined by the generic parameter FFNBYTE" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="AEL" width="8" begin="7" end="0" resetval="0x0" description="Buffer Almost EmptyThis register holds the programmable almost empty level value used to determine almost empty buffer condition If the user wants an interrupt or a DMA write request to be issued during a transmit operation when the data buffer is able to receive n bytes, then the buffer MCSPI_MODULCTRL[AEL] must be set with n-1" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="MCSPI1_DAFTX" acronym="MCSPI1_DAFTX" offset="0x180" width="32" description="">
		<bitfield id="DAFTDATA" width="32" begin="31" end="0" resetval="0x0" description="FIFO Data to transmit with DMA 256 bit aligned address This Register is only is used when MCSPI_MODULCTRL[FDAA] is set to '1' and only one of the MCSPI_CH[i]CONF[FFEW] of enabled channels is set If these conditions are not respected any access to this register return a null value" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MCSPI1_DAFRX" acronym="MCSPI1_DAFRX" offset="0x1A0" width="32" description="">
		<bitfield id="DAFRDATA" width="32" begin="31" end="0" resetval="0x0" description="FIFO Data to transmit with DMA 256 bit aligned address This Register is only is used when MCSPI_MODULCTRL[FDAA] is set to '1' and only one of the MCSPI_CH[i]CONF[FFEW] of enabled channels is set If these conditions are not respected any access to this register return a null value" range="31 - 0" rwaccess="RO"/>
	</register>
</module>